Revit 2027 API
ParameterTypeId.CurveWallOffsetRoofs Property
 "Overhang"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveWallOffsetRoofs { get; }
Public Shared ReadOnly Property CurveWallOffsetRoofs As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveWallOffsetRoofs {
	ForgeTypeId^ get ();
}
static member CurveWallOffsetRoofs : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace